/* ========================================= *
*         ===  КОМПОНЕНТ #LOADER  ===         *
* ========================================= */

// [С]-> Статический метод
// [Ч]-> Частный метод
// [П]-> Публичный метод
// [ПH]-> Публичный-наследуемый метод
// [ПФ]-> Приватная функция
// (Э)-> Экземпляр класса
// {P}-> Вызываем конструктор, свойство или метод родительского класса

import {Component} from "../core/component"

export class LoaderComponent extends Component {

  /* ===========================
   *        Конструктор        *
   =========================== */

  constructor(id) {

    super(id); // {P}-> вызываем конструктор родителя

  }


}
