/* ========================================= *
*         ===  ВАЛИДАТОР ФОРМ  ===           *
* ========================================= */

// [С]-> Статический метод
// [Ч]-> Частный метод
// [П]-> Публичный метод
// [ПH]-> Публичный-наследуемый метод
// (Э)-> Экземпляр класса
// {P}-> Вызываем конструктор, свойство или метод родительского класса

export class Validators {

  /* ===========================
   *    Статические методы     *
   =========================== */

  // > Валидатор: вы незаполнили поле <
  static required(value = '') {
    return value && value.trim()
  }

  // > Валидатор: минимальное число симаолов <
  static minLength(length) {
    return value => {
      return value.length >= length
    }
  }
}
